{"timestamp": "2018-01-03 02:22:04.596135", "userid": "5a4cae938af7d", "history": [{"c": ["What are your movie interests?"], "u": ["action"]}, {"c": ["Can you tell me some actors or actresses you like?"], "u": ["keanu reeves"]}, {"c": ["Tell me a director you prefer."], "u": ["any"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["any"]}, {"c": ["I'm thinking about what you might like.", "How about The Matrix (1999)? ", "The Matrix stars Lana Wachowski, Keanu Reeves, Zach Staenberg, Laurence Fishburne, Bill Pope, Don Davis, Carrie-Anne Moss, Joel Silver, Lilly Wachowski, Hugo Weaving and is directed by Lilly Wachowski, Lana Wachowski.", "This film is 136 minutes long. It is an action and sci-fi movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about John Wick: Chapter 2 (2017)? ", "John Wick: Chapter 2 stars Chad Stahelski, Keanu Reeves, Riccardo Scamarcio, Erica Lee, Joel J. Richard, Tyler Bates, Derek Kolstad, Ruby Rose, Basil Iwanyk, Ian McShane and is directed by Derek Kolstad.", "This film is 122 minutes long. It is an action, crime and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about John Wick (2014)? ", "John Wick stars Willem Dafoe, Derek Kolstad, David Leitch, Chad Stahelski, Keanu Reeves, Alfie Allen, Mike Witherill, Basil Iwanyk, Michael Nyqvist, Eva Longoria and is directed by Derek Kolstad.", "This film is 101 minutes long. It is an action, crime and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Speed (1994)? ", "Speed stars Mark Gordon, Dennis Hopper, Keanu Reeves, Andrzej Bartkowiak, Sandra Bullock, Graham Yost, Joe Morton, John Wright, Jan de Bont, Mark Mancina and is directed by Graham Yost.", "This film is 116 minutes long. It is an action, adventure and crime movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
