{"timestamp": "2018-01-03 02:20:20.438055", "userid": "5a4cada762381", "history": [{"c": ["What types of movies, or genres, do you like?"], "u": ["sci-fi"]}, {"c": ["I'd like to get to know what your actor preferences are."], "u": ["chris pine"]}, {"c": ["who is your favorite director?"], "u": ["any"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["any"]}, {"c": ["I'm thinking about what you might like.", "How about Star Trek (2009)? ", "Star Trek stars Zachary Quinto, Chris Pine, Alex Kurtzman, Damon Lindelof, Michael Giacchino, Gene Roddenberry, Roberto Orci, J.J. Abrams, Leonard Nimoy, Simon Pegg and is directed by Roberto Orci, Alex Kurtzman, Gene Roddenberry.", "This film is 127 minutes long. It is an action, adventure and sci-fi movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Wonder Woman (2017)? ", "Wonder Woman stars Jason Fuchs, Charles Roven, William Moulton Marston, Gal Gadot, Chris Pine, Robin Wright, Lucy Davis, Patty Jenkins, Allan Heinberg, Zack Snyder and is directed by Allan Heinberg, Zack Snyder, Jason Fuchs, William Moulton Marston.", "This film is 141 minutes long. It is an action, adventure and fantasy movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Star Trek Into Darkness (2013)? ", "Star Trek Into Darkness stars Bryan Burk, Chris Pine, Gene Roddenberry, Zoe Saldana, Roberto Orci, Benedict Cumberbatch, Damon Lindelof, Zachary Quinto, Alex Kurtzman, J.J. Abrams and is directed by Roberto Orci, Alex Kurtzman, Damon Lindelof, Gene Roddenberry.", "This film is 132 minutes long. It is an action, adventure and sci-fi movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Hell or High Water (2016)? ", "Hell or High Water stars Peter Berg, David Mackenzie, Jeff Bridges, Gil Birmingham, Ben Foster, Carla Hacken, Chris Pine, Sidney Kimmel, Julie Yorn, Taylor Sheridan and is directed by Taylor Sheridan.", "This film is 102 minutes long. It is a crime, drama and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Rise of the Guardians (2012)? ", "Rise of the Guardians stars Isla Fisher, Chris Pine, David Lindsay-Abaire, William Joyce, Christina Steinberg, Nancy Bernstein, Alexandre Desplat, Peter Ramsey, Hugh Jackman, Alec Baldwin and is directed by David Lindsay-Abaire, William Joyce.", "This film is 97 minutes long. It is an adventure, animation and family movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Star Trek Beyond (2016)? ", "Star Trek Beyond stars Karl Urban, Patrick McKay, Justin Lin, Gene Roddenberry, Simon Pegg, Zachary Quinto, Chris Pine, Doug Jung, Zoe Saldana, Roberto Orci and is directed by Simon Pegg, Doug Jung, Gene Roddenberry, Roberto Orci, Patrick McKay, John D. Payne.", "This film is 122 minutes long. It is an action, adventure and sci-fi movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Unstoppable (2010)? ", "Unstoppable stars Mimi Rogers, Denzel Washington, Alex Young, Julie Yorn, Rosario Dawson, Chris Pine, Ethan Suplee, Tony Scott, Mark Bomback, Eric McLeod and is directed by Mark Bomback.", "This film is 98 minutes long. It is an action and thriller movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about This Means War (2012)? ", "This Means War stars Tom Hardy, Marcus Gautesen, Til Schweiger, Reese Witherspoon, McG, Timothy Dowling, Chris Pine, Robert Simonds, Simon Kinberg, James Lassiter and is directed by Timothy Dowling, Simon Kinberg, Marcus Gautesen.", "This film is 103 minutes long. It is an action, comedy and romance movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Jack Ryan: Shadow Recruit (2014)? ", "Jack Ryan: Shadow Recruit stars Adam Cozad, Kenneth Branagh, David Koepp, Chris Pine, Tom Clancy, Kevin Costner, Lorenzo di Bonaventura, Keira Knightley, David Barron, Mace Neufeld and is directed by Adam Cozad, David Koepp, Tom Clancy.", "This film is 105 minutes long. It is an action, drama and thriller movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Into the Woods (2014)? ", "Into the Woods stars Stephen Sondheim, Anna Kendrick, Meryl Streep, Chris Pine, Emily Blunt, Rob Marshall, Marc Platt, James Lapine, Callum McDougall, John DeLuca and is directed by James Lapine, Stephen Sondheim.", "This film is 125 minutes long. It is an adventure, fantasy and musical movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "I'm sorry but there is no recommendation that can be made with your criteria.", "Bye! Please click the next button to proceed."], "u": []}]}
