{"timestamp": "2018-01-03 08:38:40.206538", "userid": "5a4d06cb0c1df", "history": [{"c": ["Tell me a genre you prefer?"], "u": ["i like action movies"]}, {"c": ["Who is your favorite actor or actress?"], "u": ["brad pitt"]}, {"c": ["Tell me a director you prefer."], "u": ["any"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["pg-13"]}, {"c": ["I'm thinking about what you might like.", "There is no exact match for what was specified, so I will do my best!", "How about Fury (2014)? ", "Fury stars Bill Block, John Lesher, David Ayer, Steven Price, Logan Lerman, Michael Peña, Brad Pitt, Ethan Smith, Roman Vasyanov, Shia LaBeouf and is directed by David Ayer.", "This film is 134 minutes long. It is an action, drama and war movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Megamind (2010)? ", "Megamind stars Tina Fey, Lara Breay, Denise Nolan Cascino, Lorne Balfe, Brent Simons, Alan Schoolcraft, Tom McGrath, Brad Pitt, Will Ferrell, Jonah Hill and is directed by Alan Schoolcraft, Brent Simons.", "This film is 95 minutes long. It is an action, animation and comedy movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Troy (2004)? ", "Troy stars Homer, Brad Pitt, Eric Bana, Orlando Bloom, Julian Glover, Wolfgang Petersen, David Benioff, Diana Rathbun, Colin Wilson, James Horner and is directed by Homer, David Benioff.", "This film is 163 minutes long. It is an action, drama and history movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Spy Game (2001)? ", "Spy Game stars Harry Gregson-Williams, Robert Redford, Michael Frost Beckner, Brad Pitt, David Arata, Marc Abraham, Tony Scott, Catherine McCormack, Douglas Wick, Stephen Dillane and is directed by Michael Frost Beckner, David Arata.", "This film is 126 minutes long. It is an action, crime and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Allied (2016)? ", "Allied stars Alan Silvestri, Brad Pitt, Jared Harris, Graham King, Don Burgess, Vincent Ebrahim, Steven Knight, Marion Cotillard, Steve Starkey, Robert Zemeckis and is directed by Steven Knight.", "This film is 124 minutes long. It is an action, drama and romance movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
