{"timestamp": "2018-01-11 00:09:29.240699", "userid": "5a571a5f3386f", "history": [{"c": ["Tell me a genre you prefer?"], "u": ["family and animation"]}, {"c": ["Please tell me the people you like to see in a movie."], "u": ["any"]}, {"c": ["who is your favorite director?"], "u": ["any"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["any"]}, {"c": ["I'm thinking about what you might like.", "Mulan stars Philip LaZebnik, Ming-Na Wen, Eddie Murphy, Rita Hsiao, Robert D. San Souci, BD Wong, Tony Bancroft, Chris Sanders, Miguel Ferrer, Barry Cook and is directed by Robert D. San Souci, Rita Hsiao, Chris Sanders, Philip LaZebnik, Raymond Singer, Eugenia Bostwick-Singer, Dean DeBlois, John Sanford, Chris Williams, Tim Hodge, Julius Aguimatang, Burny Mattinson, Lorna Cook, Barry Johnson, Thom Enriquez, Ed Gombert, Joe Grant, Floyd Norman, Linda Woolverton, Jodi Ann Johnson, Alan Ormsby, David Reynolds, Don Dougherty, Jorgen Klubien, Denis Rich, Joe Ekers, Theodore Newton, Larry Scholl, Daan Jippes, Frank Nissen, Jeff Snow, Anonymous.", "How about Mulan (1998)? ", "This film is 88 minutes long. It is an adventure, animation and family movie, and is rated G.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Alice in Wonderland (2010)? ", "This film is 108 minutes long. It is an adventure, family and fantasy movie, and is rated PG.", "Alice in Wonderland stars Johnny Depp, Lewis Carroll, Helena Bonham Carter, Anne Hathaway, Tim Burton, Jennifer Todd, Linda Woolverton, Mia Wasikowska, Suzanne Todd, Joe Roth and is directed by Linda Woolverton, Lewis Carroll.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Spirited Away (2001)? ", "Spirited Away stars Donald W. Ernst, Suzanne Pleshette, Atsushi Okui, John Lasseter, Rumi Hiiragi, Miyu Irino, Daveigh Chase, Joe Hisaishi, Toshio Suzuki, Hayao Miyazaki and is directed by Hayao Miyazaki.", "This film is 125 minutes long. It is an adventure, animation and family movie, and is rated .", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about The Jungle Book (2016)? ", "This film is 106 minutes long. It is an adventure, drama and family movie, and is rated PG.", "The Jungle Book stars Jon Favreau, John Debney, Idris Elba, Bill Pope, Neel Sethi, Justin Marks, Bill Murray, Rudyard Kipling, Brigham Taylor, Ben Kingsley and is directed by Justin Marks, Rudyard Kipling.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
