{"timestamp": "2018-01-11 11:48:41.154154", "userid": "5a57bf47b61d1", "history": [{"c": ["What types of movies, or genres, do you like?"], "u": ["comedy"]}, {"c": ["Can you tell me some actors or actresses you prefer to watch?"], "u": ["Travolta"]}, {"c": ["Tell me a director you prefer."], "u": ["Tarantino"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["R"]}, {"c": ["I'm thinking about what you might like.", "There is no exact match for what was specified, so I will do my best!", "How about Forrest Gump (1994)? ", "Forrest Gump stars Wendy Finerman, Winston Groom, Robert Zemeckis, Gary Sinise, Eric Roth, Steve Starkey, Sally Field, Steve Tisch, Robin Wright, Tom Hanks and is directed by Winston Groom, Eric Roth.", "This film is 142 minutes long. It is a comedy, drama and romance movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Life Is Beautiful (1997)? ", "Life Is Beautiful stars Gianluigi Braschi, Roberto Benigni, Giorgio Cantarini, Vincenzo Cerami, Tonino Delli Colli, Nicola Piovani, Elda Ferri, Nicoletta Braschi, John M. Davis, Giustino Durano and is directed by Vincenzo Cerami, Roberto Benigni.", "This film is 116 minutes long. It is a comedy, drama and war movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about City Lights (1931)? ", "City Lights stars Roland Totheroh, Gordon Pollock, Harry Clive, Harry Myers, Virginia Cherrill, Harry Crocker, Charles Chaplin, Florence Lee and is directed by Charles Chaplin, Harry Carr, Harry Crocker.", "This film is 87 minutes long. It is a comedy, drama and romance movie, and is rated G.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about City Lights (1931)? ", "City Lights stars Roland Totheroh, Gordon Pollock, Harry Clive, Harry Myers, Virginia Cherrill, Harry Crocker, Charles Chaplin, Florence Lee and is directed by Charles Chaplin, Harry Carr, Harry Crocker.", "This film is 87 minutes long. It is a comedy, drama and romance movie, and is rated G.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964)? ", "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb stars Sterling Hayden, Stanley Kubrick, Anthony Harvey, Peter George, George C. Scott, Gilbert Taylor, Keenan Wynn, Laurie Johnson, Terry Southern, Peter Sellers and is directed by Stanley Kubrick, Terry Southern, Peter George.", "This film is 95 minutes long. It is a comedy movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
