{"timestamp": "2018-01-11 00:19:10.038419", "userid": "5a571dbf0cf4f", "history": [{"c": ["Can you tell me some genres?"], "u": ["family and romance"]}, {"c": ["Please tell me the people you like to see in a movie."], "u": ["any"]}, {"c": ["Tell me a director you prefer."], "u": ["any"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["any"]}, {"c": ["I'm thinking about what you might like.", "How about The Karate Kid Part II (1986)? ", "The Karate Kid Part II stars Robert Mark Kamen, James Crabe, David Garfield, Pat Morita, Bill Conti, Bruce Malmuth, John G. Avildsen, Eddie Smith, Jerry Weintraub, Ralph Macchio and is directed by Robert Mark Kamen.", "This film is 113 minutes long. It is an action, family and romance movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about A Cinderella Story (2004)? ", "A Cinderella Story stars Dan Byrd, Ilyssa Goodman, Hilary Duff, Dylan Sellers, Hunt Lowry, Mark Rosman, Clifford Werber, Leigh Dunlap, Chad Michael Murray, Jennifer Coolidge and is directed by Leigh Dunlap.", "This film is 95 minutes long. It is a comedy, family and romance movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about The Princess Diaries 2: Royal Engagement (2004)? ", "The Princess Diaries 2: Royal Engagement stars Anne Hathaway, Meg Cabot, Whitney Houston, Julie Andrews, Garry Marshall, Hector Elizondo, Callum Blue, Debra Martin Chase, Gina Wendkos, Shonda Rhimes and is directed by Meg Cabot, Gina Wendkos, Shonda Rhimes.", "This film is 113 minutes long. It is a comedy, family and romance movie, and is rated G.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Father of the Bride (1991)? ", "Father of the Bride stars Martin Short, Diane Keaton, Albert Hackett, Nancy Meyers, Frances Goodrich, Steve Martin, Kimberly Williams-Paisley, Carol Baum, Howard Rosenman, Charles Shyer and is directed by Frances Goodrich, Albert Hackett, Nancy Meyers, Charles Shyer.", "This film is 105 minutes long. It is a comedy, family and romance movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Jingle All the Way (1996)? ", "This film is 89 minutes long. It is a comedy and family movie, and is rated PG.", "Jingle All the Way stars Michael Barnathan, Phil Hartman, Arnold Schwarzenegger, Chris Columbus, Rita Wilson, Brian Levant, David Newman, Sinbad, Randy Kornfield, Mark Radcliffe and is directed by Randy Kornfield.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
