{"timestamp": "2018-01-19 16:37:09.312461", "userid": "5a628e3a36fc5", "history": [{"c": ["What types of films do you like to see?"], "u": ["I like action movies"]}, {"c": ["I'd like to get to know what your actor preferences are."], "u": ["I like Tom Cruise"]}, {"c": ["Tell me a director you prefer."], "u": ["I am not specific about directors"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["It can be PG-13 or R rated."]}, {"c": ["I'm thinking about what you might like.", "There is no exact match for what was specified, so I will do my best!", "How about Minority Report (2002)? ", "Minority Report stars Scott Frank, Philip K. Dick, Jon Cohen, Bonnie Curtis, Steven Spielberg, Jan de Bont, Max von Sydow, Samantha Morton, Colin Farrell, Tom Cruise and is directed by Philip K. Dick, Scott Frank, Jon Cohen.", "This film is 145 minutes long. It is an action, adventure and crime movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Is there anything that is newer that you can recommend?"]}, {"c": ["", "How about Minority Report (2002)? ", "Minority Report stars Scott Frank, Philip K. Dick, Jon Cohen, Bonnie Curtis, Steven Spielberg, Jan de Bont, Max von Sydow, Samantha Morton, Colin Farrell, Tom Cruise and is directed by Philip K. Dick, Scott Frank, Jon Cohen.", "This film is 145 minutes long. It is an action, adventure and crime movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Yes, that will be fine."]}, {"c": ["", "How about Mission: Impossible (1996)? ", "Mission: Impossible stars Emmanuelle Béart, Henry Czerny, Tom Cruise, Jon Voight, Paula Wagner, Steven Zaillian, David Koepp, Brian De Palma, Robert Towne, Bruce Geller and is directed by Bruce Geller, David Koepp, Steven Zaillian, Robert Towne.", "This film is 110 minutes long. It is an action, adventure and thriller movie, and is rated .", "Is this recommendation satisfactory?"], "u": ["Yes, that is a good choice also."]}, {"c": ["", "How about Top Gun (1986)? ", "Top Gun stars Kelly McGillis, Jerry Bruckheimer, Val Kilmer, Tom Cruise, Tony Scott, Jim Cash, Jack Epps Jr., Tim Robbins, Ehud Yonay, Warren Skaaren and is directed by Jim Cash, Jack Epps Jr., Ehud Yonay, Warren Skaaren.", "This film is 110 minutes long. It is an action, drama and romance movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["Are there any other movies you can recommend?"]}, {"c": ["", "How about Mission: Impossible II (2000)? ", "Mission: Impossible II stars Robert Towne, Paula Wagner, Ronald D. Moore, Tom Cruise, Ving Rhames, John Woo, Thandie Newton, Brannon Braga, Bruce Geller, Dougray Scott and is directed by Bruce Geller, Ronald D. Moore, Brannon Braga, Robert Towne.", "This film is 123 minutes long. It is an action, adventure and thriller movie, and is rated .", "Is this recommendation satisfactory?"], "u": ["That is a good recommendation."]}, {"c": ["", "How about Days of Thunder (1990)? ", "Days of Thunder stars Ward Russell, Nicole Kidman, Robert Duvall, Tom Cruise, Randy Quaid, Don Simpson, Robert Towne, Hans Zimmer, Jerry Bruckheimer, Tony Scott and is directed by Robert Towne, Tom Cruise.", "This film is 107 minutes long. It is an action, drama and sport movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["That is a little old for me, but it might work."]}, {"c": ["", "I'm sorry but there is no recommendation that can be made with your criteria.", "Bye! Please click the next button to proceed."], "u": []}]}
