{"timestamp": "2018-01-21 09:47:58.039541", "userid": "5a64d1ef9d85b", "history": [{"c": ["What are your movie interests?"], "u": ["I'm more into suspense, drama and comedy"]}, {"c": ["Tell me some actors you like.", "There is no exact match for what was specified, so I will do my best!"], "u": ["Brad Pitt, Ryan Reynolds"]}, {"c": ["who is your favorite director?"], "u": ["Steven Spelburg"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["R"]}, {"c": ["I'm thinking about what you might like.", "How about The Godfather (1972)? "], "u": ["Sure"]}, {"c": ["The Godfather stars Marlon Brando, William Reynolds, Gordon Willis, Nino Rota, Albert S. Ruddy, Mario Puzo, Francis Ford Coppola, Diane Keaton, James Caan, Al Pacino and is directed by Mario Puzo, Francis Ford Coppola.", "This film is 175 minutes long. It is a crime and drama movie, and is rated R.", "Is this recommendation satisfactory?", "", "How about Schindler's List (1993)? ", "Schindler's List stars Branko Lustig, Steven Zaillian, John Williams, Ralph Fiennes, Steven Spielberg, Liam Neeson, Thomas Keneally, Caroline Goodall, Gerald R. Molen, Ben Kingsley and is directed by Thomas Keneally, Steven Zaillian.", "This film is 195 minutes long. It is a biography, drama and history movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Yes that's good"]}, {"c": ["", "How about 12 Angry Men (1957)? ", "12 Angry Men stars Lee J. Cobb, Carl Lerner, Henry Fonda, Boris Kaufman, John Fiedler, Martin Balsam, Sidney Lumet, Kenyon Hopkins, Reginald Rose and is directed by Reginald Rose."], "u": ["movies"]}, {"c": ["This film is 96 minutes long. It is a crime and drama movie, and is rated .", "Is this recommendation satisfactory?", "", "How about 12 Angry Men (1957)? ", "12 Angry Men stars Lee J. Cobb, Carl Lerner, Henry Fonda, Boris Kaufman, John Fiedler, Martin Balsam, Sidney Lumet, Kenyon Hopkins, Reginald Rose and is directed by Reginald Rose.", "This film is 96 minutes long. It is a crime and drama movie, and is rated ."], "u": ["Yes"]}, {"c": ["Is this recommendation satisfactory?", "", "Bye! Please click the next button to proceed."], "u": []}]}
