{"timestamp": "2018-01-25 17:43:57.158504", "userid": "5a6a8754a76b3", "history": [{"c": ["What are your movie interests?"], "u": ["i prefer action"]}, {"c": ["Tell me some actors you like."], "u": ["keanu reeves"]}, {"c": ["Tell me a director you prefer."], "u": ["any"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["any"]}, {"c": ["I'm thinking about what you might like.", "How about The Matrix (1999)? ", "The Matrix stars Lana Wachowski, Keanu Reeves, Zach Staenberg, Laurence Fishburne, Bill Pope, Don Davis, Carrie-Anne Moss, Joel Silver, Lilly Wachowski, Hugo Weaving and is directed by Lilly Wachowski, Lana Wachowski.", "This film is 136 minutes long. It is an action and sci-fi movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Speed (1994)? ", "Speed stars Mark Gordon, Dennis Hopper, Keanu Reeves, Andrzej Bartkowiak, Sandra Bullock, Graham Yost, Joe Morton, John Wright, Jan de Bont, Mark Mancina and is directed by Graham Yost.", "This film is 116 minutes long. It is an action, adventure and crime movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Speed (1994)? ", "Speed stars Mark Gordon, Dennis Hopper, Keanu Reeves, Andrzej Bartkowiak, Sandra Bullock, Graham Yost, Joe Morton, John Wright, Jan de Bont, Mark Mancina and is directed by Graham Yost.", "This film is 116 minutes long. It is an action, adventure and crime movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Johnny Mnemonic (1995)? ", "Johnny Mnemonic stars Dina Meyer, Don Carmody, Keanu Reeves, Robert Longo, Ice-T, Brad Fiedel, François Protat, Mychael Danna, Dolph Lundgren, William Gibson and is directed by William Gibson.", "This film is 96 minutes long. It is an action, crime and sci-fi movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "I'm sorry but there is no recommendation that can be made with your criteria.", "Bye! Please click the next button to proceed."], "u": []}]}
