{"timestamp": "2018-01-31 17:42:41.717543", "userid": "5a726ff05b1ee", "history": [{"c": ["I am trying to understand your genre preferences."], "u": ["I like comedy movies."]}, {"c": ["Who is your favorite actor or actress?"], "u": ["Will Ferrell"]}, {"c": ["Tell me a director you prefer."], "u": ["Adam McKay"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["R"]}, {"c": ["I'm thinking about what you might like.", "How about Raiders of the Lost Ark (1981)? ", "Raiders of the Lost Ark stars Philip Kaufman, Lawrence Kasdan, Steven Spielberg, John Williams, John Rhys-Davies, George Lucas, Frank Marshall, Paul Freeman, Harrison Ford, Karen Allen and is directed by Lawrence Kasdan, George Lucas, Philip Kaufman.", "This film is 115 minutes long. It is an action and adventure movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about The Matrix (1999)? ", "The Matrix stars Lana Wachowski, Keanu Reeves, Zach Staenberg, Laurence Fishburne, Bill Pope, Don Davis, Carrie-Anne Moss, Joel Silver, Lilly Wachowski, Hugo Weaving and is directed by Lilly Wachowski, Lana Wachowski.", "This film is 136 minutes long. It is an action and sci-fi movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Hotel Rwanda (2004)? ", "Hotel Rwanda stars Afro Celt Sound System, Rupert Gregson-Williams, Xolani Mali, Sophie Okonedo, A. Kitman Ho, Andrea Guerra, Joaquin Phoenix, Keir Pearson, Don Cheadle, Terry George and is directed by Keir Pearson, Terry George.", "This film is 121 minutes long. It is a biography, drama and history movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Braveheart (1995)? ", "Braveheart stars Bruce Davey, Mel Gibson, Randall Wallace, Alan Ladd Jr., John Toll, Angus Macfadyen, Sophie Marceau, Steven Rosenblum, James Horner, Patrick McGoohan and is directed by Randall Wallace.", "This film is 178 minutes long. It is a biography, drama and history movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about The Usual Suspects (1995)? ", "The Usual Suspects stars Michael McDonnell, Gabriel Byrne, Chazz Palminteri, Stephen Baldwin, Bryan Singer, Christopher McQuarrie, John Ottman, Newton Thomas Sigel, Howard Cummings, Kevin Spacey and is directed by Christopher McQuarrie.", "This film is 106 minutes long. It is a crime, drama and mystery movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
