{"timestamp": "2018-01-31 17:13:49.528168", "userid": "5a7268b65062d", "history": [{"c": ["Can you tell me some genres?"], "u": ["Genres of what?"]}, {"c": ["Tell me some actors you like."], "u": ["I like Pierce Brosnan, Sean Connery and Brad Pitt."]}, {"c": ["who is your favorite director?"], "u": ["Ridley Scott."]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["G rating."]}, {"c": ["I'm thinking about what you might like.", "How about Dead Silence (2007)? ", "Dead Silence stars Michael Fairman, Charlie Clouser, Amber Valletta, James Wan, Oren Koules, Mark Burg, Ryan Kwanten, Donnie Wahlberg, Gregg Hoffman, Leigh Whannell and is directed by Leigh Whannell, James Wan.", "This film is 89 minutes long. It is a horror and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Can you recommend something else?"]}, {"c": ["", "How about Transcendence (2014)? ", "Transcendence stars Annie Marter, Morgan Freeman, Wally Pfister, Johnny Depp, Cillian Murphy, Rebecca Hall, Broderick Johnson, Kate Cohen, Andrew A. Kosove, Jack Paglen and is directed by Jack Paglen.", "This film is 119 minutes long. It is a drama, mystery and romance movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Yes, that sounds great."]}, {"c": ["", "How about Underworld (2003)? ", "Underworld stars Tom Rosenberg, Gary Lucchesi, Kate Beckinsale, Shane Brolly, Danny McBride, Scott Speedman, Richard S. Wright, Kevin Grevioux, Len Wiseman, Michael Sheen and is directed by Kevin Grevioux, Len Wiseman, Danny McBride.", "This film is 121 minutes long. It is an action, fantasy and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Yes, I love the Underworld series."]}, {"c": ["", "How about Sherlock Holmes (2009)? ", "Sherlock Holmes stars Jude Law, Simon Kinberg, Michael Robert Johnson, Lionel Wigram, Robert Downey Jr., Mark Strong, Rachel McAdams, Arthur Conan Doyle, Anthony Peckham, Guy Ritchie and is directed by Michael Robert Johnson, Anthony Peckham, Simon Kinberg, Lionel Wigram, Arthur Conan Doyle.", "This film is 128 minutes long. It is an action, adventure and crime movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Yes, that would be a good movie."]}, {"c": ["", "How about Red Riding Hood (2011)? ", "Red Riding Hood stars David Leslie Johnson, Leonardo DiCaprio, Catherine Hardwicke, Billy Burke, Amanda Seyfried, Alex Heffes, Julie Yorn, Gary Oldman, Lukas Haas, Jennifer Davisson and is directed by David Leslie Johnson.", "This film is 100 minutes long. It is a fantasy, horror and mystery movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["What else do you think I might like?"]}, {"c": ["", "How about Season of the Witch (2011)? ", "Season of the Witch stars Charles Roven, Nicolas Cage, Claire Foy, Dominic Sena, Stephen Campbell Moore, Bragi F. Schut, Alex Gartner, Amir Mokri, Atli Örvarsson, Ron Perlman and is directed by Bragi F. Schut.", "This film is 95 minutes long. It is an action, adventure and fantasy movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Yes."]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
