{"timestamp": "2018-02-03 02:22:15.494335", "userid": "5a758c46aa791", "history": [{"c": ["What types of films do you like to see?"], "u": ["all of em, but scifi the most"]}, {"c": ["Can you tell me some actors or actresses you like?"], "u": ["oscar isaac has been quite good lately"]}, {"c": ["Tell me a director you prefer."], "u": ["kubrick is the best of course"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["what movie?"]}, {"c": ["I'm thinking about what you might like.", "How about 2 Fast 2 Furious (2003)? ", "2 Fast 2 Furious stars Derek Haas, Cole Hauser, Neal H. Moritz, John Singleton, David Arnold, Tyrese Gibson, Michael Brandt, Paul Walker, Eva Mendes, Gary Scott Thompson and is directed by Gary Scott Thompson, Michael Brandt, Derek Haas.", "This film is 107 minutes long. It is an action, crime and thriller movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["ucks"]}, {"c": [""], "u": ["no"]}, {"c": ["", "How about Street Fighter (1994)? "], "u": ["that movie is terrible :("]}, {"c": ["Street Fighter stars Edward M. Abroms, Jean-Claude Van Damme, Raul Julia, Ming-Na Wen, Damian Chapa, Steven E. de Souza, Edward R. Pressman, Kenzo Tsujimoto, Graeme Revell, William A. Fraker and is directed by Steven E. de Souza.", "This film is 102 minutes long. It is an action, adventure and comedy movie, and is rated PG-13.", "Is this recommendation satisfactory?", "", "How about Hackers (1995)? ", "Hackers stars Ralph Winter, Matthew Lillard, Simon Boswell, Iain Softley, Michael Peyser, Jesse Bradford, Guy Pratt, Rafael Moreu, Angelina Jolie, Jonny Lee Miller and is directed by Rafael Moreu.", "This film is 107 minutes long. It is a comedy, crime and drama movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["those are also terrible, but in a good way"]}, {"c": ["", "How about The Station Agent (2003)? ", "The Station Agent stars Oliver Bokelberg, Paul Benjamin, Peter Dinklage, Robert May, Tom McCarthy, Mary Jane Skalski, Bobby Cannavale, Stephen Trask, Kathryn Tucker, Patricia Clarkson and is directed by Tom McCarthy.", "This film is 89 minutes long. It is a comedy and drama movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["that might be good"]}, {"c": ["", "How about The Beach (2000)? ", "The Beach stars Danny Boyle, Andrew Macdonald, Leonardo DiCaprio, John Hodge, Patcharawan Patarakijjanon, Virginie Ledoyen, Angelo Badalamenti, Daniel York, Darius Khondji, Alex Garland and is directed by John Hodge, Alex Garland.", "This film is 119 minutes long. It is an adventure, drama and romance movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["I liked that one"]}, {"c": ["", "How about Home Alone (1990)? ", "Home Alone stars Julio Macat, Raja Gosnell, John Williams, John Hughes, John Muto, Chris Columbus, John Heard, Daniel Stern, Joe Pesci, Macaulay Culkin and is directed by John Hughes.", "This film is 103 minutes long. It is a comedy and family movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no thanks"]}, {"c": ["", "How about True Grit (2010)? ", "True Grit stars Carter Burwell, Josh Brolin, Matt Damon, Joel Coen, Scott Rudin, Roger Deakins, Ethan Coen, Hailee Steinfeld, Charles Portis, Jeff Bridges and is directed by Joel Coen, Ethan Coen, Charles Portis.", "This film is 110 minutes long. It is an adventure, drama and western movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["yes, but I've seen it"]}, {"c": ["", "How about Babe (1995)? ", "Babe stars Dick King-Smith, Doug Mitchell, Magda Szubanski, Bill Miller, Miriam Margolyes, Christine Cavanaugh, George Miller, Chris Noonan, James Cromwell, Nigel Westlake and is directed by Dick King-Smith, George Miller, Chris Noonan.", "This film is 91 minutes long. It is a comedy, drama and family movie, and is rated G.", "Is this recommendation satisfactory?"], "u": ["no, eww"]}, {"c": ["", "How about Uncle Buck (1989)? ", "Uncle Buck stars Ira Newborn, John Candy, Gaby Hoffmann, John Hughes, Ralf D. Bode, Tom Jacobson, Tony Lombardo, Lou Lombardo, Jean Louisa Kelly, Macaulay Culkin and is directed by John Hughes.", "This film is 100 minutes long. It is a comedy movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["the thing with your recommendations is I've seen them all"]}, {"c": ["", "How about Annie Hall (1977)? ", "Annie Hall stars Marshall Brickman, Wendy Greene Bricmont, Diane Keaton, Carol Kane, Tony Roberts, Woody Allen, Ralph Rosenblum, Charles H. Joffe, Gordon Willis and is directed by Woody Allen, Marshall Brickman.", "This film is 93 minutes long. It is a comedy and romance movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["t"]}, {"c": ["", "How about The Spy Who Loved Me (1977)? "], "u": ["also great but seen it"]}, {"c": ["The Spy Who Loved Me stars Lewis Gilbert, Christopher Wood, Barbara Bach, Albert R. Broccoli, Roger Moore, Marvin Hamlisch, Ian Fleming, Richard Maibaum, Richard Kiel, Curd Jürgens and is directed by Christopher Wood, Richard Maibaum, Ian Fleming.", "This film is 125 minutes long. It is an action, adventure and thriller movie, and is rated PG.", "Is this recommendation satisfactory?", "", "How about Sabotage (2014)? "], "u": ["seen all the Bonds"]}, {"c": ["Sabotage stars Ethan Smith, Skip Woods, Terrence Howard, Palak Patel, Arnold Schwarzenegger, Paul Hanson, Olivia Williams, Bill Block, David Ayer, Sam Worthington and is directed by Skip Woods, David Ayer.", "This film is 109 minutes long. It is an action, crime and drama movie, and is rated R.", "Is this recommendation satisfactory?", "", "How about Red Dawn (2012)? ", "Red Dawn stars Kevin Reynolds, Dan Bradley, Chris Hemsworth, Isabel Lucas, Josh Peck, Josh Hutcherson, Beau Flynn, Carl Ellsworth, Jeremy Passmore, John Milius and is directed by Carl Ellsworth, Jeremy Passmore, Kevin Reynolds, John Milius.", "This film is 93 minutes long. It is an action and thriller movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["haven't seen that"]}, {"c": ["", "How about Sisters (2015)? ", "Sisters stars Jason Moore, Paula Pell, Maya Rudolph, Christophe Beck, John S. Lyons, Amy Poehler, Jay Roach, Barry Peterson, Tina Fey, Ike Barinholtz and is directed by Paula Pell.", "This film is 118 minutes long. It is a comedy movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["looks not good"]}, {"c": ["", "How about Mystery Men (1999)? ", "Mystery Men stars Kinka Usher, Neil Cuthbert, Mike Richardson, Lloyd Levin, Hank Azaria, William H. Macy, Lawrence Gordon, Janeane Garofalo, Bob Burden, Ben Stiller and is directed by Neil Cuthbert, Bob Burden.", "This film is 121 minutes long. It is an action, comedy and fantasy movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
