{"timestamp": "2018-02-03 01:38:20.686347", "userid": "5a758270d0f30", "history": [{"c": ["Can you tell me some genres?"], "u": ["Horror and classics"]}, {"c": ["I'd like to get to know what your actor preferences are."], "u": ["Jennifer Connelly, Emma Roberts, Jessica Harper"]}, {"c": ["Tell me a director you prefer."], "u": ["Dario Argento"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["R"]}, {"c": ["I'm thinking about what you might like.", "How about Fright Night (2011)? ", "Fright Night stars Tom Holland, David Tennant, Toni Collette, Alison R. Rosenzweig, Anton Yelchin, Ramin Djawadi, Michael De Luca, Marti Noxon, Colin Farrell, Craig Gillespie and is directed by Marti Noxon, Tom Holland.", "This film is 106 minutes long. It is a comedy and horror movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Saw it and I didn't like it."]}, {"c": ["", "How about The Texas Chainsaw Massacre (2003)? ", "The Texas Chainsaw Massacre stars Mike Fleiss, Jonathan Tucker, Andrew Bryniarski, Michael Bay, Scott Kosar, Erica Leerhsen, Kim Henkel, Marcus Nispel, Tobe Hooper, Jessica Biel and is directed by Kim Henkel, Tobe Hooper, Scott Kosar.", "This film is 98 minutes long. It is a horror movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["I didn't like that one either."]}, {"c": ["", "How about Dancer in the Dark (2000)? ", "Dancer in the Dark stars David Morse, Robby Müller, Vibeke Windeløv, Karl Júlíusson, François Gédigier, Peter Stormare, Björk, Molly Marlene Stensgaard, Lars von Trier, Catherine Deneuve and is directed by Lars von Trier.", "This film is 140 minutes long. It is a crime, drama and musical movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Yes, I'll try that one."]}, {"c": ["", "How about Wrong Turn (2003)? ", "Wrong Turn stars Eliza Dushku, Rob Schmidt, Jeremy Sisto, Robert Kulzer, Erik Feig, Emmanuelle Chriqui, Brian J. Gilbert, Stan Winston, Desmond Harrington, Alan B. McElroy and is directed by Alan B. McElroy.", "This film is 84 minutes long. It is a horror movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Yes."]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
