{"timestamp": "2018-02-03 01:58:37.295286", "userid": "5a75866b2ae52", "history": [{"c": ["Please tell me some genres you like."], "u": ["I like country music."]}, {"c": ["Can you tell me some actors or actresses you like?"], "u": ["I like Abigail Spencer."]}, {"c": ["who is your favorite director?"], "u": ["I do not really have a favorite director."]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["What movie?"]}, {"c": ["I'm thinking about what you might like.", "How about 2 Fast 2 Furious (2003)? ", "2 Fast 2 Furious stars Derek Haas, Cole Hauser, Neal H. Moritz, John Singleton, David Arnold, Tyrese Gibson, Michael Brandt, Paul Walker, Eva Mendes, Gary Scott Thompson and is directed by Gary Scott Thompson, Michael Brandt, Derek Haas.", "This film is 107 minutes long. It is an action, crime and thriller movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["That is a good movie!"]}, {"c": ["", "How about Dark Water (2005)? ", "Dark Water stars Takashige Ichise, Ariel Gade, John C. Reilly, Walter Salles, Jennifer Connelly, Rafael Yglesias, Tim Roth, Hideo Nakata, Doug Davison, Kôji Suzuki and is directed by Kôji Suzuki, Hideo Nakata, Takashige Ichise, Rafael Yglesias.", "This film is 105 minutes long. It is a drama, horror and thriller movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["I do not think I would like that movie."]}, {"c": ["", "How about Street Fighter (1994)? ", "Street Fighter stars Edward M. Abroms, Jean-Claude Van Damme, Raul Julia, Ming-Na Wen, Damian Chapa, Steven E. de Souza, Edward R. Pressman, Kenzo Tsujimoto, Graeme Revell, William A. Fraker and is directed by Steven E. de Souza.", "This film is 102 minutes long. It is an action, adventure and comedy movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Are we done?"]}, {"c": ["", "How about Hackers (1995)? ", "Hackers stars Ralph Winter, Matthew Lillard, Simon Boswell, Iain Softley, Michael Peyser, Jesse Bradford, Guy Pratt, Rafael Moreu, Angelina Jolie, Jonny Lee Miller and is directed by Rafael Moreu.", "This film is 107 minutes long. It is a comedy, crime and drama movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Yes."]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
