{"timestamp": "2018-02-03 02:33:15.060831", "userid": "5a758d5aee4b9", "history": [{"c": ["What are your movie interests?"], "u": ["Comedy and drama."]}, {"c": ["Tell me some actors you like."], "u": ["Reese Witherspoon and Kevin Bacon."]}, {"c": ["who is your favorite director?"], "u": ["Ridley Scott."]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["PG-13"]}, {"c": ["I'm thinking about what you might like.", "How about The Straight Story (1999)? "], "u": ["ay."]}, {"c": ["The Straight Story stars Neal Edelstein, Jane Galloway Heitz, Joseph A. Carpenter, Freddie Francis, Angelo Badalamenti, John Roach, Sissy Spacek, David Lynch, Mary Sweeney, Richard Farnsworth and is directed by John Roach, Mary Sweeney.", "This film is 112 minutes long. It is a biography and drama movie, and is rated G.", "Is this recommendation satisfactory?", ""], "u": ["Yes, I've never seen that and it sounds good."]}, {"c": [""], "u": ["How would I watch it?"]}, {"c": ["", "How about Fried Green Tomatoes (1991)? ", "Fried Green Tomatoes stars Jordan Kerner, Thomas Newman, Carol Sobieski, Jon Avnet, Kathy Bates, Mary Stuart Masterson, Mary-Louise Parker, Geoffrey Simpson, Fannie Flagg, Jessica Tandy and is directed by Fannie Flagg, Carol Sobieski.", "This film is 130 minutes long. It is a drama movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["No, I've already seen that."]}, {"c": ["", "How about Election (1999)? ", "Election stars David Gale, Reese Witherspoon, Keith Samples, Jessica Campbell, Alexander Payne, Jim Taylor, Tom Perrotta, Matthew Broderick, Albert Berger, Chris Klein and is directed by Tom Perrotta, Alexander Payne, Jim Taylor.", "This film is 103 minutes long. It is a comedy, drama and romance movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Yes, I love that one."]}, {"c": ["", "How about Dancer in the Dark (2000)? ", "Dancer in the Dark stars David Morse, Robby Müller, Vibeke Windeløv, Karl Júlíusson, François Gédigier, Peter Stormare, Björk, Molly Marlene Stensgaard, Lars von Trier, Catherine Deneuve and is directed by Lars von Trier.", "This film is 140 minutes long. It is a crime, drama and musical movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Sure, I'd like to try that."]}, {"c": ["", "How about The Experiment (2001)? ", "The Experiment stars Christian Berkel, Mario Giordano, Wotan Wilke Möhring, Christoph Darnstädt, Oliver Hirschbiegel, Oliver Stokowski, Moritz Bleibtreu, Norbert Preuss, Marc Conrad, Don Bohlinger and is directed by Mario Giordano, Christoph Darnstädt, Don Bohlinger.", "This film is 120 minutes long. It is a drama and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["What is the plot like?"]}, {"c": ["", "How about Eraserhead (1977)? ", "Eraserhead stars Herbert Cardwell, Frederick Elmes, Allen Joseph, David Lynch, Charlotte Stewart, Jeanne Bates, Jack Nance and is directed by David Lynch.", "This film is 89 minutes long. It is a fantasy and horror movie, and is rated NR.", "Is this recommendation satisfactory?"], "u": ["Yeah, I have been meaning to see that."]}, {"c": ["", "How about Holes (2003)? ", "Holes stars Mike Medavoy, Shia LaBeouf, Andrew Davis, Teresa Tucker-Davies, Jon Voight, Tim Blake Nelson, Louis Sachar, Sigourney Weaver, Lowell D. Blank, Joel McNeely and is directed by Louis Sachar.", "This film is 117 minutes long. It is an adventure, comedy and drama movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["Yes, that sound good."]}, {"c": ["", "How about Mallrats (1995)? ", "Mallrats stars Jason Lee, Ira Newborn, Scott Mosier, James Jacks, Sean Daniel, Shannen Doherty, Jeremy London, Claire Forlani, Kevin Smith, David Klein and is directed by Kevin Smith.", "This film is 94 minutes long. It is a comedy and romance movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["That one is okay, I don't know if I would want to listen again."]}, {"c": ["", "How about Sister Act (1992)? ", "Sister Act stars Adam Greenberg, Kathy Najimy, Maggie Smith, Marc Shaiman, Wendy Makkena, Emile Ardolino, Colleen Halsey, Teri Schwartz, Paul Rudnick, Whoopi Goldberg and is directed by Paul Rudnick.", "This film is 100 minutes long. It is a comedy, crime and family movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["Eh, that's kind of a one-time watch."]}, {"c": ["", "How about My Sister's Keeper (2009)? ", "My Sister's Keeper stars Cameron Diaz, Jeremy Leven, Chuck Pacheco, Abigail Breslin, Mark Johnson, Jodi Picoult, Alec Baldwin, Scott Goldman, Nick Cassavetes, Walter Raney and is directed by Jeremy Leven, Nick Cassavetes, Jodi Picoult.", "This film is 109 minutes long. It is a drama movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["Yeah, I'd like to see that."]}, {"c": ["", "How about Four Weddings and a Funeral (1994)? ", "Four Weddings and a Funeral stars Mike Newell, Hugh Grant, Jon Gregory, Michael Coulter, James Fleet, Simon Callow, Richard Curtis, Duncan Kenworthy, Andie MacDowell, Richard Rodney Bennett and is directed by Richard Curtis.", "This film is 117 minutes long. It is a comedy, drama and romance movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["Yes, that one sounds good."]}, {"c": ["", "How about Empire of the Sun (1987)? ", "Empire of the Sun stars J.G. Ballard, Tom Stoppard, Frank Marshall, Kathleen Kennedy, Miranda Richardson, John Malkovich, Menno Meyjes, Christian Bale, Nigel Havers, Steven Spielberg and is directed by Tom Stoppard, J.G. Ballard, Menno Meyjes.", "This film is 153 minutes long. It is a drama, history and war movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["Yes."]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
