{"timestamp": "2018-02-03 00:38:11.958608", "userid": "5a75748f21383", "history": [{"c": ["Please tell me some genres you like."], "u": ["action"]}, {"c": ["Can you tell me some actors or actresses you like?"], "u": ["keanu reeves"]}, {"c": ["who is your favorite director?"], "u": ["anyone"]}, {"c": ["What MPAA rating should this movie be (eg. PG-13, pg, G)?"], "u": ["any"]}, {"c": ["I'm thinking about what you might like.", "How about Friday Night Lights (2004)? ", "Friday Night Lights stars Jay Hernandez, Brian Reitzell, Explosions in the Sky, Brian Grazer, David Aaron Cohen, Buzz Bissinger, Peter Berg, Lucas Black, Derek Luke, Billy Bob Thornton and is directed by Buzz Bissinger, David Aaron Cohen, Peter Berg.", "This film is 118 minutes long. It is an action, drama and sport movie, and is rated PG-13.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about The Jacket (2005)? ", "The Jacket stars Kris Kristofferson, George Clooney, Peter Guber, Daniel Craig, Keira Knightley, Adrien Brody, John Maybury, Marc Rocco, Massy Tadjedin, Tom Bleecker and is directed by Tom Bleecker, Marc Rocco, Massy Tadjedin.", "This film is 103 minutes long. It is a drama, mystery and sci-fi movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about The Santa Clause (1994)? ", "The Santa Clause stars Jeffrey Silver, Steve Rudnick, Robert F. Newmyer, Tim Allen, Brian Reilly, Wendy Crewson, Eric Lloyd, Leo Benvenuti, Judge Reinhold, John Pasquin and is directed by Leo Benvenuti, Steve Rudnick.", "This film is 97 minutes long. It is a comedy, drama and family movie, and is rated PG.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Following (1998)? ", "Following stars Lucy Russell, Emma Thomas, Jeremy Theobald, David Julyan, John Nolan, Gareth Heal, Alex Haw, Christopher Nolan and is directed by Christopher Nolan.", "This film is 69 minutes long. It is a crime, mystery and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Sunshine (2007)? ", "Sunshine stars Rose Byrne, Alwin H. Küchler, Cillian Murphy, Michelle Yeoh, John Murphy, Chris Evans, Chris Gill, Alex Garland, Andrew Macdonald, Danny Boyle and is directed by Alex Garland.", "This film is 107 minutes long. It is an adventure, sci-fi and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["no"]}, {"c": ["", "How about Candyman (1992)? ", "Candyman stars Sigurjon Sighvatsson, Tony Todd, Kasi Lemmons, Philip Glass, Bernard Rose, Virginia Madsen, Clive Barker, Alan Poul, Xander Berkeley, Steve Golin and is directed by Clive Barker, Bernard Rose.", "This film is 99 minutes long. It is a horror and thriller movie, and is rated R.", "Is this recommendation satisfactory?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
