{"timestamp": "2018-02-15 05:46:20.363013", "userid": "5a858e4807365", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "What genre of movies do you want?"], "u": ["romantic comedy"]}, {"c": ["Who would you like to see starring in a movie?"], "u": ["Kristen Chenowith"]}, {"c": ["Tell me some directors that you like."], "u": ["Rob Reiner is the only one I can remember.  John Hughes too"]}, {"c": ["What MPAA rating should this movie be?"], "u": ["pg-13 or below"]}, {"c": ["I'm thinking about what you might like.", "How about Happy Gilmore (1996)? ", "Happy Gilmore stars Julie Bowen, Frances Bay, Arthur Albert, Christopher McDonald, Robert Simonds, Adam Sandler, Dennis Dugan, Mark Mothersbaugh, Tim Herlihy, Jeff Gourson and is directed by Tim Herlihy, Adam Sandler.", "This film is 92 minutes long. It is a comedy and sport movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["I don't think I have"]}, {"c": ["", "Do you like this recommendation?"], "u": ["Do  you have another recommendation?"]}, {"c": ["", "How about Billy Madison (1995)? ", "Billy Madison stars John Gilroy, Tamra Davis, Tim Herlihy, Bridgette Wilson-Sampras, Bradley Whitford, Robert Simonds, Randy Edelman, Victor Hammer, Darren McGavin, Adam Sandler and is directed by Tim Herlihy, Adam Sandler.", "This film is 89 minutes long. It is a comedy movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["no"]}, {"c": ["", "How about Mallrats (1995)? ", "Mallrats stars Jason Lee, Ira Newborn, Scott Mosier, James Jacks, Sean Daniel, Shannen Doherty, Jeremy London, Claire Forlani, Kevin Smith, David Klein and is directed by Kevin Smith.", "This film is 94 minutes long. It is a comedy and romance movie, and is rated R.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about Spanglish (2004)? ", "Spanglish stars Richard Marks, Richard Sakai, Hans Zimmer, Adam Sandler, Julie Ansell, Paz Vega, James L. Brooks, Cloris Leachman, John Seale, Téa Leoni and is directed by James L. Brooks.", "This film is 131 minutes long. It is a comedy, drama and romance movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about Hotel Rwanda (2004)? ", "Hotel Rwanda stars Afro Celt Sound System, Rupert Gregson-Williams, Xolani Mali, Sophie Okonedo, A. Kitman Ho, Andrea Guerra, Joaquin Phoenix, Keir Pearson, Don Cheadle, Terry George and is directed by Keir Pearson, Terry George.", "This film is 121 minutes long. It is a biography, drama and history movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["no"]}, {"c": ["", "How about Dazed and Confused (1993)? ", "Dazed and Confused stars Lee Daniel, Wiley Wiggins, Sean Daniel, Sandra Adair, John Frick, Matthew McConaughey, Jason London, James Jacks, Rory Cochrane, Richard Linklater and is directed by Richard Linklater.", "This film is 102 minutes long. It is a comedy movie, and is rated R.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
