{"timestamp": "2018-02-15 06:47:08.685954", "userid": "5a859ce83f76f", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "What genre of films do you like to see?"], "u": ["Comedy"]}, {"c": ["Who are your favorite actors or actresses?"], "u": ["Adam Sandler"]}, {"c": ["Tell me some directors that you like."], "u": ["Unsure"]}, {"c": ["What should the MPAA rating for this movie be?"], "u": ["PG"]}, {"c": ["I'm thinking about what you might like.", "How about Caddyshack (1980)? ", "Caddyshack stars Chevy Chase, Ted Knight, Brian Doyle-Murray, Johnny Mandel, Harold Ramis, Douglas Kenney, William C. Carruth, Rodney Dangerfield, Bill Murray, Stevan Larner and is directed by Brian Doyle-Murray, Harold Ramis, Douglas Kenney.", "This film is 98 minutes long. It is a comedy and sport movie, and is rated R.", "Have you watched this movie before?"], "u": ["Yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["Yes"]}, {"c": ["", "How about Coffee and Cigarettes (2003)? ", "Coffee and Cigarettes stars Jim Stark, Jason Kliot, Demetra J. MacBride, Rudd Simmons, Bill Murray, Roberto Benigni, Cassis Birgit Staudt, Jim Jarmusch, RZA, Tom Waits and is directed by Jim Jarmusch.", "This film is 95 minutes long. It is a comedy, drama and music movie, and is rated R.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No"]}, {"c": ["", "How about Galaxy Quest (1999)? ", "Galaxy Quest stars David Newman, Tony Shalhoub, Tim Allen, Alan Rickman, Charles Newirth, Dean Parisot, Mark Johnson, Robert Gordon, Sigourney Weaver, David Howard and is directed by David Howard, Robert Gordon.", "This film is 102 minutes long. It is an adventure, comedy and sci-fi movie, and is rated PG.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["Yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
