{"timestamp": "2018-02-17 15:44:41.817076", "userid": "5a88bde3a1db6", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Can you tell me what movie genres you like?"], "u": ["Sci-Fi, fantasy, comedy"]}, {"c": ["Who would you like to see starring in a movie?"], "u": ["Uhh I wouldn't care"]}, {"c": ["Can you tell me which director you like?"], "u": ["Spielberg is good"]}, {"c": ["What MPAA rating should this movie be?"], "u": ["R"]}, {"c": ["I'm thinking about what you might like.", "How about The City of Lost Children (1995)? ", "The City of Lost Children stars Marc Caro, Gilles Adrien, Félicie Dutertre, Dominique Pinon, Guillaume Laurant, María Victoria Hebrero, Judith Vittet, Jean-Pierre Jeunet, Daniel Emilfork, Ron Perlman and is directed by Gilles Adrien, Jean-Pierre Jeunet, Marc Caro, Guillaume Laurant.", "This film is 112 minutes long. It is a fantasy and sci-fi movie, and is rated R.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No"]}, {"c": ["", "How about Ghost in the Shell (1995)? ", "Ghost in the Shell stars Akio Ôtsuka, Iemasa Kayumi, Ken Matsumoto, Kazunori Itô, Mitsuhisa Ishikawa, Shirow Masamune, Kôichi Yamadera, Mamoru Oshii, Atsuko Tanaka, Ken Iyadomi and is directed by Shirow Masamune, Kazunori Itô.", "This film is 83 minutes long. It is an action, animation and crime movie, and is rated NR.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No"]}, {"c": ["", "How about Army of Darkness (1992)? ", "Army of Darkness stars Sam Raimi, Ivan Raimi, Ian Abercrombie, Marcus Gilbert, Embeth Davidtz, Rob Tapert, Bruce Campbell, Joseph LoDuca, Bill Pope, Bob Murawski and is directed by Sam Raimi, Ivan Raimi.", "This film is 81 minutes long. It is a comedy and horror movie, and is rated R.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["no"]}, {"c": ["", "How about Beetlejuice (1988)? ", "Beetlejuice stars Michael Bender, Michael McDowell, Warren Skaaren, Tim Burton, Larry Wilson, Alec Baldwin, Annie McEnroe, Richard Hashimoto, Michael Keaton, Geena Davis and is directed by Michael McDowell, Larry Wilson, Warren Skaaren.", "This film is 92 minutes long. It is a comedy and fantasy movie, and is rated PG.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No"]}, {"c": ["", "How about Dogma (1999)? ", "Dogma stars Matt Damon, Scott Mosier, Robert Holtzman, Ben Affleck, Kevin Smith, Linda Fiorentino, Howard Shore, Bud Cort, Robert D. Yeoman and is directed by Kevin Smith.", "This film is 130 minutes long. It is an adventure, comedy and drama movie, and is rated R.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No"]}, {"c": ["", "How about Trainspotting (1996)? ", "Trainspotting stars Ewen Bremner, John Hodge, Irvine Welsh, Brian Tufano, Andrew Macdonald, Jonny Lee Miller, Masahiro Hirakubo, Danny Boyle, Ewan McGregor, Kevin McKidd and is directed by John Hodge, Irvine Welsh.", "This film is 94 minutes long. It is a drama movie, and is rated R.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["sure"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
