{"timestamp": "2018-02-20 06:40:08.861855", "userid": "5a8c310235cb0", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "What genre of films do you like to see?"], "u": ["Sci-fi"]}, {"c": ["Can you tell me some actors or actresses you prefer to watch?"], "u": ["no prefernce"]}, {"c": ["Who is your favorite director?"], "u": ["hitchcock"]}, {"c": ["Tell me what MPAA rating should this movie have."], "u": ["doesn't matter"]}, {"c": ["I'm thinking about what you might like.", "How about Castle in the Sky (1986)? ", "Castle in the Sky stars Joe Hisaishi, James Van Der Beek, Hayao Miyazaki, Anna Paquin, Hirokata Takahashi, Isao Takahata, Yoshihiro Kasahara, Mark Hamill, Jonathan Swift, Cloris Leachman and is directed by Hayao Miyazaki, Jonathan Swift.", "This film is 125 minutes long. It is an adventure, animation and family movie, and is rated PG.", "Have you watched this movie before?"], "u": ["no\\"]}, {"c": ["", "Do you like this recommendation?"], "u": ["no it's for kids"]}, {"c": ["", "How about Irreversible (2002)? ", "Irreversible stars Jo Prestia, Thomas Bangalter, Alain Juteau, Albert Dupontel, Monica Bellucci, Christophe Rossignon, Vincent Cassel, Benoît Debie, Gaspar Noé and is directed by Gaspar Noé.", "This film is 97 minutes long. It is a crime, drama and mystery movie, and is rated NC-17.", "Have you watched this movie before?"], "u": ["no too provacative"]}, {"c": ["", "Do you like this recommendation?"], "u": ["too provacative"]}, {"c": ["", "How about Battle Royale (2000)? ", "Battle Royale stars Tatsuya Fujiwara, Kimio Kataoka, Koushun Takami, Chie Kobayashi, Kenta Fukasaku, Tarô Yamamoto, Aki Maeda, Toshio Nabeshima, Kinji Fukasaku, Takeshi Kitano and is directed by Koushun Takami, Kenta Fukasaku.", "This film is 114 minutes long. It is an adventure, drama and sci-fi movie, and is rated R.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["no too violent"]}, {"c": ["", "How about Yojimbo (1961)? ", "Yojimbo stars Masaru Satô, Ryûzô Kikushima, Kazuo Miyagawa, Yôko Tsukasa, Toshirô Mifune, Yoshirô Muraki, Tatsuya Nakadai, Eijirô Tôno, Akira Kurosawa and is directed by Akira Kurosawa, Ryûzô Kikushima.", "This film is 110 minutes long. It is an action, drama and thriller movie, and is rated NR.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["no"]}, {"c": ["", "How about Audition (1999)? ", "Audition stars Takashi Miike, Satoshi Fukushima, Akemi Suyama, Daisuke Tengan, Eihi Shiina, Kôji Endô, Ryû Murakami, Ryo Ishibashi, Tetsu Sawaki, Jun Kunimura and is directed by Ryû Murakami, Daisuke Tengan.", "This film is 115 minutes long. It is a drama, horror and mystery movie, and is rated R.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about Porco Rosso (1992)? ", "Porco Rosso stars Joe Hisaishi, Bunshi Katsura Vi, Hayao Miyazaki, Atsushi Okui, Shûichirô Moriyama, Tsunehiko Kamijô, Tokiko Katô, Rick Dempsey, Toshio Suzuki, Mark Henley and is directed by Hayao Miyazaki.", "This film is 94 minutes long. It is an adventure, animation and comedy movie, and is rated PG.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["one more please"]}, {"c": ["", "How about Infernal Affairs (2002)? ", "Infernal Affairs stars Felix Chong, Ronald Ng, Wai-Keung Lau, Eric Tsang, Alan Mak, Anthony Chau-Sang Wong, Kwong Wing Chan, Tony Chiu-Wai Leung, Yiu-Fai Lai, Andy Lau and is directed by Alan Mak, Felix Chong.", "This film is 101 minutes long. It is a crime, mystery and thriller movie, and is rated R.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
