{"timestamp": "2018-02-20 08:59:25.977913", "userid": "5a8c53886aa54", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Tell me a movie genre you prefer?"], "u": ["comedy"]}, {"c": ["Tell me some actors or actresses you like."], "u": ["joe rogan"]}, {"c": ["Who is your favorite director?"], "u": ["eli roth"]}, {"c": ["What MPAA rating should this movie be?"], "u": ["r"]}, {"c": ["I'm thinking about what you might like.", "How about Office Space (1999)? ", "Office Space stars Tim Suhrstedt, David Rennie, Michael Rotenberg, Mike Judge, Ajay Naidu, David Herman, John Frizzell, Daniel Rappaport, Jennifer Aniston, Ron Livingston and is directed by Mike Judge.", "This film is 89 minutes long. It is a comedy movie, and is rated R.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about Tommy Boy (1995)? ", "Tommy Boy stars Chris Farley, David Newman, Terry Turner, Brian Dennehy, David Spade, Victor J. Kemper, Peter Segal, Lorne Michaels, Bo Derek, Bonnie Turner and is directed by Bonnie Turner, Terry Turner.", "This film is 97 minutes long. It is an adventure and comedy movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about Happy Gilmore (1996)? ", "Happy Gilmore stars Julie Bowen, Frances Bay, Arthur Albert, Christopher McDonald, Robert Simonds, Adam Sandler, Dennis Dugan, Mark Mothersbaugh, Tim Herlihy, Jeff Gourson and is directed by Tim Herlihy, Adam Sandler.", "This film is 92 minutes long. It is a comedy and sport movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["no"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
