{"timestamp": "2018-02-22 03:54:22.688348", "userid": "5a8ead43588e3", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "What genre of films do you like to see?"], "u": ["action"]}, {"c": ["Can you tell me some actors or actresses you like?"], "u": ["arnold schwarzenegger"]}, {"c": ["Can you tell me which director you like?"], "u": ["F. Gary Gray"]}, {"c": ["What MPAA rating should this movie be? (eg. PG-13, R, G)"], "u": ["PG-13"]}, {"c": ["I'm thinking about what you might like.", "Have you watched this movie before?"], "u": ["Yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["Yes"]}, {"c": ["", "How about Battle Royale (2000)? ", "Battle Royale stars Tatsuya Fujiwara, Kimio Kataoka, Koushun Takami, Chie Kobayashi, Kenta Fukasaku, Tarô Yamamoto, Aki Maeda, Toshio Nabeshima, Kinji Fukasaku, Takeshi Kitano and is directed by Koushun Takami, Kenta Fukasaku.", "This film is 114 minutes long. It is an adventure, drama and sci-fi movie, and is rated R.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["i don't like"]}, {"c": ["", "How about Castle in the Sky (1986)? ", "Castle in the Sky stars Joe Hisaishi, James Van Der Beek, Hayao Miyazaki, Anna Paquin, Hirokata Takahashi, Isao Takahata, Yoshihiro Kasahara, Mark Hamill, Jonathan Swift, Cloris Leachman and is directed by Hayao Miyazaki, Jonathan Swift.", "This film is 125 minutes long. It is an adventure, animation and family movie, and is rated PG.", "Have you watched this movie before?"], "u": ["Yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["Yes"]}, {"c": ["", "How about Fight Club (1999)? ", "Fight Club stars Zach Grenier, Meat Loaf, Art Linson, Jim Uhls, Ross Grayson Bell, David Fincher, Brad Pitt, Ceán Chaffin, Chuck Palahniuk, Edward Norton and is directed by Chuck Palahniuk, Jim Uhls.", "This film is 139 minutes long. It is a drama movie, and is rated R.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["Yes I like"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
