{"timestamp": "2018-02-22 05:19:42.616340", "userid": "5a8ec2f8c0d92", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Please tell me your movie genre preferences."], "u": ["Drama, Science Fiction, Fantasy, Comedy"]}, {"c": ["Tell me your actor/actress preferences."], "u": ["Emily Blunt, Idris Elba, Michael B. Jordan"]}, {"c": ["Tell me a director you prefer."], "u": ["Paul Thomas Anderson"]}, {"c": ["What MPAA rating should this movie be? (eg. PG-13, R, G)"], "u": ["R"]}, {"c": ["I'm thinking about what you might like.", "How about Into the Woods (2014)? ", "Into the Woods stars Stephen Sondheim, Anna Kendrick, Meryl Streep, Chris Pine, Emily Blunt, Rob Marshall, Marc Platt, James Lapine, Callum McDougall, John DeLuca and is directed by James Lapine, Stephen Sondheim.", "This film is 125 minutes long. It is an adventure, fantasy and musical movie, and is rated PG.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about Sweeney Todd: The Demon Barber of Fleet Street (2007)? ", "Sweeney Todd: The Demon Barber of Fleet Street stars John Logan, Johnny Depp, Helena Bonham Carter, Alan Rickman, Timothy Spall, Tim Burton, Hugh Wheeler, Christopher Bond, Laurie MacDonald, Walter F. Parkes and is directed by John Logan, Hugh Wheeler, Christopher Bond.", "This film is 116 minutes long. It is a drama, horror and musical movie, and is rated R.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about My Neighbor Totoro (1988)? ", "My Neighbor Totoro stars Mark Henley, Toru Hara, Hitoshi Takagi, Noriko Hidaka, Joe Hisaishi, Shigesato Itoi, Hayao Miyazaki, Chika Sakamoto, Hisao Shirai, Ned Lott and is directed by Hayao Miyazaki.", "This film is 86 minutes long. It is an animation, family and fantasy movie, and is rated G.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
