{"timestamp": "2018-02-22 07:31:40.868955", "userid": "5a8ee1d06550e", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "What genre of movies do you want?"], "u": ["Drama"]}, {"c": ["Can you tell me some actors or actresses you prefer to watch?"], "u": ["Brad Pitt, Will Smith, Reese Witherspoon"]}, {"c": ["Tell me some directors that you like."], "u": ["I don't really have any favorite directors"]}, {"c": ["Tell me what MPAA rating should this movie have. (eg. PG-13, R, G)"], "u": ["PG-13 or R"]}, {"c": ["I'm thinking about what you might like.", "How about Seven Years in Tibet (1997)? ", "Seven Years in Tibet stars John H. Williams, John Williams, Becky Johnston, Heinrich Harrer, Jean-Jacques Annaud, Mako, Iain Smith, BD Wong, David Thewlis, Brad Pitt and is directed by Heinrich Harrer, Becky Johnston.", "This film is 136 minutes long. It is an adventure, biography and drama movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["I have not"]}, {"c": ["", "Do you like this recommendation?"], "u": ["Not really, anything more recent?"]}, {"c": ["", "How about Legends of the Fall (1994)? ", "Legends of the Fall stars James Horner, Brad Pitt, Marshall Herskovitz, Julia Ormond, Aidan Quinn, Jim Harrison, William D. Wittliff, Susan Shilliday, Edward Zwick, Anthony Hopkins and is directed by Susan Shilliday, William D. Wittliff, Jim Harrison.", "This film is 133 minutes long. It is a drama, romance and war movie, and is rated R.", "Have you watched this movie before?"], "u": ["I have seen that"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No, it is even older than the first recomendation"]}, {"c": ["", "How about Men in Black II (2002)? ", "Men in Black II stars Lara Flynn Boyle, Robert Gordon, Barry Sonnenfeld, Will Smith, Walter F. Parkes, Tommy Lee Jones, Rip Torn, Lowell Cunningham, Barry Fanaro, Laurie MacDonald and is directed by Lowell Cunningham, Robert Gordon, Barry Fanaro.", "This film is 88 minutes long. It is an action, adventure and comedy movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["I have not"]}, {"c": ["", "Do you like this recommendation?"], "u": ["Yes!"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
