{"timestamp": "2018-02-22 03:53:30.770519", "userid": "5a8ead7d34a8d", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Can you tell me what movie genres you like?"], "u": ["Drama, mystery, thriller"]}, {"c": ["Tell me some actors or actresses you like."], "u": ["Tom Hardy, Cillian Murphy, Amy Adams"]}, {"c": ["Can you tell me which director you like?"], "u": ["Hitchcock, Tarkovsky, Kieslowski, Kurosawa, "]}, {"c": ["What should the MPAA rating for this movie be? (eg. PG-13, R, G)"], "u": ["G"]}, {"c": ["I'm thinking about what you might like.", "How about Castle in the Sky (1986)? ", "Castle in the Sky stars Joe Hisaishi, James Van Der Beek, Hayao Miyazaki, Anna Paquin, Hirokata Takahashi, Isao Takahata, Yoshihiro Kasahara, Mark Hamill, Jonathan Swift, Cloris Leachman and is directed by Hayao Miyazaki, Jonathan Swift.", "This film is 125 minutes long. It is an adventure, animation and family movie, and is rated PG.", "Have you watched this movie before?", ""], "u": ["I didnt watch this movie"]}, {"c": ["", "Do you like this recommendation?"], "u": ["Sorry, but I dont like this recommendation"]}, {"c": [""], "u": ["No"]}, {"c": ["My Neighbor Totoro stars Mark Henley, Toru Hara, Hitoshi Takagi, Noriko Hidaka, Joe Hisaishi, Shigesato Itoi, Hayao Miyazaki, Chika Sakamoto, Hisao Shirai, Ned Lott and is directed by Hayao Miyazaki.", "How about My Neighbor Totoro (1988)? ", "This film is 86 minutes long. It is an animation, family and fantasy movie, and is rated G.", "Have you watched this movie before?", "Do you like this recommendation?"], "u": ["Yes, I watched this movie "]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
