{"timestamp": "2018-03-01 08:47:21.043552", "userid": "5a982dba2d008", "history": [{"c": ["Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "Hi, I'm Chatbot. I'm trying to give better movie recommendations than Netflix can. We will start with some questions to figure out your interests. Then I will give you a movie available on Netflix to watch!", "What genres of movies do you like?"], "u": ["action genre"]}, {"c": ["Can you tell me some actors or actresses you prefer to watch?"], "u": ["Katty"]}, {"c": ["Tell me a director you prefer."], "u": ["Stephen king"]}, {"c": ["Tell me what MPAA rating should this movie have. (eg. PG-13, R, G)"], "u": ["R"]}, {"c": ["I'm thinking about what you might like.", "How about Unstoppable (2010)? ", "Unstoppable stars Mimi Rogers, Denzel Washington, Alex Young, Julie Yorn, Rosario Dawson, Chris Pine, Ethan Suplee, Tony Scott, Mark Bomback, Eric McLeod and is directed by Mark Bomback.", "This film is 98 minutes long. It is an action and thriller movie, and is rated PG-13.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No"]}, {"c": ["", "How about Face/Off (1997)? ", "Face/Off stars John Travolta, Alessandro Nivola, Christopher Godsick, Michael Colleary, Barrie M. Osborne, Joan Allen, Mike Werb, Terence Chang, John Woo, Nicolas Cage and is directed by Mike Werb, Michael Colleary.", "This film is 138 minutes long. It is an action, crime and sci-fi movie, and is rated R.", "Have you watched this movie before?"], "u": ["No"]}, {"c": ["", "Do you like this recommendation?"], "u": ["No"]}, {"c": ["", "How about Journey to the Center of the Earth (2008)? ", "Journey to the Center of the Earth stars Michael D. Weiss, Eric Brevig, Seth Meyers, Jennifer Flackett, Mark Levin, Anita Briem, Beau Flynn, Brendan Fraser, Josh Hutcherson, Jules Verne and is directed by Michael D. Weiss, Jennifer Flackett, Mark Levin, Jules Verne.", "This film is 93 minutes long. It is an action, adventure and family movie, and is rated PG.", "Have you watched this movie before?"], "u": ["yes"]}, {"c": ["", "Would you want another recommendation then?"], "u": ["yes"]}, {"c": ["", "How about Resident Evil: Apocalypse (2004)? ", "Resident Evil: Apocalypse stars Jeff Danna, Eric Mabius, Sienna Guillory, Oded Fehr, Alexander Witt, Don Carmody, Jeremy Bolt, Derek Rogers, Paul W.S. Anderson, Milla Jovovich and is directed by Paul W.S. Anderson.", "This film is 94 minutes long. It is an action, horror and sci-fi movie, and is rated R.", "Have you watched this movie before?"], "u": ["no"]}, {"c": ["", "Do you like this recommendation?"], "u": ["yes"]}, {"c": ["", "Bye! Please click the next button to proceed."], "u": []}]}
